<?php

return [
    'bot-status' => [
        '1' => 'درحال بررسی',
        '2' => 'تکمیل شده',
        '-1' => " لغو شده",
        '-2' => "معلق شده",
    ],
    'status' => [
        'waiting to pay' => 'در انتظار پرداخت',
        'pending' => 'درحال بررسی',
        'progressing' => 'درحال انجام',
        'complete' => 'تکمیل شده',
        'failed' => " لغو شده",
        'back money to wallet' => " عودت مبلغ به کیف پول",
        'suspended' => "معلق شده",
    ],
    'type' =>
    [
        '0' => 'همه',
        '1' => 'شماره مجازی',
        '2' => 'خدمات مجازی',
        '3' => 'اپل آیدی آماده',
        '4' => 'اپل آیدی سفارشی',
        '5' => 'آی پی ثابت',
        '6' => 'گوگل ویس',
        '7' => 'اکانت خارجی',
    ],
    'PageType' => [
        '1' => 'virtual-number',
        '2' => 'virtual-service',
        '3' => 'normal-apple-id',
        '4' => 'custom-apple-id',
        '5' => 'ip-sabet',
        '6' => 'google-voice',
        '7' => 'account',
    ],
    'PageTypeFa' => [
        '1' => 'شماره مجازی',
        '2' => 'خدمات مجازی',
        '3' => 'اپل آیدی آماده',
        '4' => 'اپل آیدی سفارشی',
        '5' => 'آی پی ثابت',
        '6' => 'گوگل ویس',
        '7' => 'اکانت خارجی',
    ],
    "pay status" => [
        'paid with wallet' => 'پرداخت شده با کیف پول' ,
        'paid with bank' => 'پرداخت شده با بانک',
        'Waiting to pay' => 'در انتظار پرداخت',
        'failed' => " لغو شده",
    ],
    "Details" => [
      'number' => 'شماره',
      'Sms' => 'کد',
      'country_code' => 'کد کشور',
      'expire_time' => 'تاریخ انقضا شماره',
      'name' => 'نوع سرویس',
      'price' => 'قیمت سرویس',
      'discount' => 'قیمت با تخفیف سرویس',
    ],
    'wallet' => [
      '1' => 'خرید با کیف پول',
      '2' => 'شارژ کیف پول',
    ],
    'charge type' => [
        'normal' => 'شارژ معمولی',
        'amazing' => 'شارژ شگفت انگیز',
        'permanent' => 'شارژ سیم کارت دایمی',
    ],
    'operator' =>
    [
        'MCI' => 'همراه اول',
        'MTN' => 'ایرانسل',
        'RTL' => 'رایتل',
    ],
    "Apple-id-Type" => [
        '1' => 'آماده',
        '2' => 'سفارشی',
    ],
    'Volume-Name' => [
      '0' => 'هیچکدام',
      '1' => '30 گیگ حجم',
      '2' => '40 گیگ حجم',
      '3' => '50 گیگ حجم',
      '4' => '75 گیگ حجم',
      '5' => '100 گیگ حجم',
      '6' => 'حجم دلخواه',
    ],
    'Volume-Gb' => [
        '0' => '0',
        '1' => '30',
        '2' => '40',
        '3' => '50',
        '4' => '75',
        '5' => '100',
        '6' => '0',
    ]
];
