<?php
return [
    'commission' => [
        'pending' => 'درحال انتظار',
        'progressing' => 'در انتظار واریز',
        'failed' => 'کنسل شده',
        'complete' => 'تکمیل شده',
    ],
    'status' => [
        'waiting to pay' => 'در انتظار پرداخت',
        'failed' => 'لغو شده',
        'Complete' => 'تکمیل شده',
        '-3' => 'مغایرت',
        '-4' => 'خطا بانک',
        '-2' => 'در حال بررسی',
    ],
    "type" => [
        '1' => 'پرداخت سفارش',
        '2' => 'برگشت وجه',
        '3' => 'شارژ کیف پول',
        '4' => 'برداشت',
        '5' => 'پورسانت',
        '6' => 'حجم اضافه',
        '8' => 'تمدید آی پی',
    ],
];
